#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Наименование = СтрШаблон("%1 ; %2 ; %3", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектНастройки,
			"Наименование"), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПериодДействия, "Наименование"),
			УидБонуснойПрограммы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли