
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеФормы()

	Элементы.Валюта.Видимость = Запись.ТипПоказателяПлана = ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.Сумма");

	Если Запись.ТипПоказателяПлана = ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.Сумма") Тогда
		Элементы.ПоказательПлана.Заголовок = "Сумма (план)";
	Иначе
		Элементы.ПоказательПлана.Заголовок = "Количество (план)";
	КонецЕсли;
	
	Элементы.ПоказательПлана.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
	Элементы.ГруппаПланЗакупок.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
	Элементы.Производитель.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
		
КонецПроцедуры	

&НаКлиенте
Процедура ТипПоказателяПланаПриИзменении(Элемент)
	УстановитьОформлениеФормы();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.УидНастройки) Тогда
		Запись.УидНастройки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьУид(Команда)
	Запись.УидНастройки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
КонецПроцедуры

