#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПодобратьКлючАналитикиУчетаБонуснойПрограммы(ОбъектНастройки, ПериодДействия, УидБонуснойПрограммы) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК КлючАналитикиУчетаБонуснойПрограммы
	|ИЗ
	|	Справочник.РА_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
	|ГДЕ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.ОбъектНастройки = &ОбъектНастройки
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.ПериодДействия = &ПериодДействия
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ПериодДействия", ПериодДействия);
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.КлючАналитикиУчетаБонуснойПрограммы;
	Иначе
		НовыйКлюч = Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.СоздатьЭлемент();
		НовыйКлюч.ОбъектНастройки = ОбъектНастройки;
		НовыйКлюч.ПериодДействия = ПериодДействия;
		НовыйКлюч.УидБонуснойПрограммы = УидБонуснойПрограммы;
		НовыйКлюч.Записать();
		
		Возврат НовыйКлюч.Ссылка;
	КонецЕсли;	
		
КонецФункции

Функция ПроверитьИспользованиеКлючаАналитикиУчетаБонуснойПрограммы(УидБонуснойПрограммы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы КАК АналитикаУчетаБонуснойПрограммы
		|ИЗ
		|	РегистрНакопления.РА_БонусыПартнерам КАК РА_БонусыПартнерам
		|ГДЕ
		|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции	

Функция ПометитьКлючАналитикиУчетаБонуснойПрограммыНаУдаление(УидБонуснойПрограммы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РА_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
		|ГДЕ
		|	РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КлючОбъект.ПометкаУдаления = Истина;
		КлючОбъект.Записать();
	КонецЦикла;
	
КонецФункции	

#КонецЕсли