
&После("ПриСозданииНаСервере")
Процедура РА_НачБонусовПартнерамПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда
		
		НовыйЭлемент = Форма.Элементы.Вставить("РА_Контролирует", Тип("ПолеФормы"), Форма.Элементы.ГруппаРодительБизнесРегион, Форма.Элементы.ШаблонЭтикетки);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.РА_Контролирует";
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Форма.Элементы.ОсновнойМенеджер, "Ширина, РастягиватьПоГоризонтали");  
		
	КонецЕсли;
		
КонецПроцедуры
