#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
			
	Для Каждого ЗаписьНЗ Из ЭтотОбъект Цикл
		Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПодобратьКлючАналитикиУчетаБонуснойПрограммы(ЗаписьНЗ.ОбъектНастройки, ЗаписьНз.ПериодДействия, ЗаписьНз.УидНастройки);	
	КонецЦикла;	
   
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоПустойНабор = Количество() = 0;
	
	Если ЭтоПустойНабор Тогда
		Прочитать(); 
	КонецЕсли;
	
	Если Количество() И ЭтоПустойНабор Тогда
		//Считаем, что это удаление записи	
		
		Для Каждого СтрокаЗаписи Из ЭтотОбъект Цикл
			НастройкаИспользуется = Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПроверитьИспользованиеКлючаАналитикиУчетаБонуснойПрограммы(СтрокаЗаписи.УидНастройки);
			Если НастройкаИспользуется Тогда
				ОбщегоНазначения.СообщитьПользователю("По настройке бонусной программы есть движения в регистрах! Удаление невозможно!",,,,Отказ);
			Иначе
				Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПометитьКлючАналитикиУчетаБонуснойПрограммыНаУдаление(СтрокаЗаписи.УидНастройки);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	//
КонецПроцедуры

#КонецОбласти

#КонецЕсли
